_posts/2015-11-22-Adding-emacs-command-key-bindings-and-help-functionality-to-org-mode.html
---
title: Adding emacs command key-bindings and help functionality to org-mode
date: 2015/11/22 10:08:18
updated: 2015/11/22 10:08:18
categories: emacs,orgmode
tags: 
---


<p>
The documentation of functions in emacs allows you to put some light markup into function doc strings that will render as the key sequence required to run the command when you look up the help on the function. I would like to have something like that in org-mode. You can look up the key-binding to a command like this:
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(substitute-command-keys <span style="color: #008000;">"\\[</span><span style="color: #D0372D;">org-agenda</span><span style="color: #008000;">]"</span>)
</pre>
</div>

<pre class="example">
C-c a
</pre>

<p>
We are going to explore a way to recognize the syntax shown above, change its appearance to alert us that we are looking at an emacs command, add a tooltip, and make it clickable to open the documentation, and s (super) clickable to find the function code. Font lock is the tool we will use for this. Basically, we need a regular expression to match the syntax, and a function to find the next instance, and put some properties on the matched text.
</p>

<p>
I made a video (<a href="https://www.youtube.com/watch?v=VLUMW0sR4Vk">https://www.youtube.com/watch?v=VLUMW0sR4Vk</a> ) showing what this post is all about. It isn't easy to see in the post ☺.
</p>

<p>
Here we use the `rx' library to build up a regular expression for this. It is a bit easier to document than a raw regexp. Since we are matching \ in the pattern, there are some obligatory escaping \ characters in there too. All we need is to integrate this into font-lock. We define a function that will move the point to the end of the next match, and put properties on the match. We will go ahead and make the text clickable so we can access documentation and code easily. The tooltip will show the key-binding to run the command.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #0000FF;">require</span> '<span style="color: #D0372D;">rx</span>)

(<span style="color: #0000FF;">defvar</span> <span style="color: #BA36A5;">elisp-symbol-keybinding-re</span>
  (<span style="color: #0000FF;">rx</span>
   <span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">opening \\[</span>
   (eval <span style="color: #008000;">"\\["</span>)
   <span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">one or more characters that are not ]</span>
   (group (one-or-more (not (any <span style="color: #008000;">"]"</span>))))
   <span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">The closing ]</span>
   <span style="color: #008000;">"]"</span>)
<span style="color: #036A07;">"Regexp for an elisp command keybinding syntax. \\[</span><span style="color: #D0372D;">some-command</span><span style="color: #036A07;">]</span>
<span style="color: #036A07;">Regexp group 1 matches `</span><span style="color: #D0372D;">some-command</span><span style="color: #036A07;">'."</span>)

(<span style="color: #0000FF;">defun</span> <span style="color: #006699;">match-next-keybinding</span> (<span style="color: #6434A3;">&amp;optional</span> limit)
  <span style="color: #036A07;">"Move point to the end of the next expression matching</span>
<span style="color: #036A07;">`</span><span style="color: #D0372D;">elisp-symbol-keybinding-re</span><span style="color: #036A07;">', and put properties on the match</span>
<span style="color: #036A07;">that shows the key sequence. Non-bound commands are not</span>
<span style="color: #036A07;">fontified."</span>
  (<span style="color: #0000FF;">when</span> (<span style="color: #0000FF;">and</span> (re-search-forward
              elisp-symbol-keybinding-re
              limit t)
             (fboundp (intern (match-string 1))))
    (<span style="color: #0000FF;">let*</span> ((beg (match-beginning 0))
           (end (match-end 0))
           (s (match-string 0))
           (command (match-string 1))
           (describe-func `(<span style="color: #0000FF;">lambda</span> ()
                    <span style="color: #036A07;">"Run `</span><span style="color: #D0372D;">describe-function</span><span style="color: #036A07;">' on the command."</span>
                    (<span style="color: #0000FF;">interactive</span>)
                    (describe-function (intern ,command))))
           (find-func `(<span style="color: #0000FF;">lambda</span> ()
                     <span style="color: #036A07;">"Run `</span><span style="color: #D0372D;">find-function</span><span style="color: #036A07;">' on the command."</span>
                     (<span style="color: #0000FF;">interactive</span>)
                     (find-function (intern ,command))))
           (map (make-sparse-keymap)))

      <span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">this is what gets run when you click on it.</span>
      (define-key map [mouse-1] describe-func)
      (define-key map [s-mouse-1] find-func)
      <span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">Here we define the text properties</span>
      (add-text-properties
       beg end
       `(local-map ,map
         mouse-face highlight
         help-echo ,(format
                     <span style="color: #008000;">"%s\n\nClick for documentation.\ns-mouse-1 to find function."</span>
                     (substitute-command-keys s))
         keybinding t)))))
</pre>
</div>

<p>
Let's go ahead and make syntax for `some-command' too. This one seems simple enough we just write a regexp for it.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #0000FF;">defun</span> <span style="color: #006699;">match-next-emacs-command</span> (<span style="color: #6434A3;">&amp;optional</span> limit)
  <span style="color: #036A07;">"Move point to the end of the next expression matching</span>
<span style="color: #036A07;">`</span><span style="color: #D0372D;">this-syntax</span><span style="color: #036A07;">', and put a tooltip on the match</span>
<span style="color: #036A07;">that shows the key sequence. Works on commands and variables."</span>
  (<span style="color: #0000FF;">when</span> (<span style="color: #0000FF;">and</span> (re-search-forward
              <span style="color: #008000;">"`</span><span style="color: #008000; font-weight: bold;">\\</span><span style="color: #008000; font-weight: bold;">(</span><span style="color: #008000;">[</span><span style="color: #008000;">^</span><span style="color: #008000;">']+</span><span style="color: #008000; font-weight: bold;">\\</span><span style="color: #008000; font-weight: bold;">)</span><span style="color: #008000;">'"</span>
              limit t)
             (<span style="color: #0000FF;">or</span> (boundp (intern (match-string 1)))
                 (fboundp (intern (match-string 1)))))
    (<span style="color: #0000FF;">let*</span> ((beg (match-beginning 0))
           (end (match-end 0))
           (s (match-string 0))
           (command (match-string 1))
           (describe-func
            `(<span style="color: #0000FF;">lambda</span> ()
               <span style="color: #036A07;">"Run `</span><span style="color: #D0372D;">describe-function/variable</span><span style="color: #036A07;">' on the command."</span>
               (<span style="color: #0000FF;">interactive</span>)
               (<span style="color: #0000FF;">cond</span> ((fboundp (intern ,command))
                      (describe-function (intern ,command)))
                     ((boundp (intern ,command))
                      (describe-variable (intern ,command))))))
           (find-func `(<span style="color: #0000FF;">lambda</span> ()
                     <span style="color: #036A07;">"Run `</span><span style="color: #D0372D;">find-function</span><span style="color: #036A07;">' on the command."</span>
                     (<span style="color: #0000FF;">interactive</span>)
                     (find-function (intern ,command))))
           (map (make-sparse-keymap)))

      <span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">this is what gets run when you click on it.</span>
      (define-key map [mouse-1] describe-func)
      (define-key map [s-mouse-1] find-func)
      <span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">Here we define the text properties</span>
      (add-text-properties
       beg end
       `(local-map ,map
         mouse-face highlight
         help-echo ,(format
                     <span style="color: #008000;">"%s\n\nClick for documentation.%s"</span>
                     (<span style="color: #0000FF;">if</span> (fboundp (intern command))
                         (substitute-command-keys (format <span style="color: #008000;">"\\[</span><span style="color: #D0372D;">%s</span><span style="color: #008000;">]"</span> command))
                       <span style="color: #008000;">"Variable"</span>)
                     (<span style="color: #0000FF;">if</span> (fboundp (intern command))
                         <span style="color: #008000;">"\ns-mouse-1 to find function."</span>
                       <span style="color: #008000;">""</span>))
         keybinding t)))))
</pre>
</div>

<p>
Now we need a way to turn them on and off. We do that here with a minor mode.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #0000FF;">define-minor-mode</span> <span style="color: #006699;">emacs-keybinding-command-tooltip-mode</span>
  <span style="color: #036A07;">"Fontify on emacs keybinding syntax. Adds a tooltip for</span>
<span style="color: #036A07;">keybinding, and make the command clickable to get to the</span>
<span style="color: #036A07;">documentation."</span>
  <span style="color: #006FE0;">:lighter</span> <span style="color: #008000;">" KB"</span>
  (<span style="color: #0000FF;">if</span> emacs-keybinding-command-tooltip-mode
      <span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">turn them on</span>
      (font-lock-add-keywords
       nil
       '((match-next-keybinding 1 font-lock-constant-face)
         (match-next-emacs-command 1 font-lock-constant-face)))
    <span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">turn them off</span>
    (font-lock-remove-keywords
     nil
     '((match-next-keybinding 1 font-lock-constant-face)
       (match-next-emacs-command 1 font-lock-constant-face))))
  (font-lock-fontify-buffer))
</pre>
</div>

<p>
Here we turn it on:
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(emacs-keybinding-command-tooltip-mode -1)
</pre>
</div>

<p>
Here are some sample uses. You can use  \\[org-toggle-latex-overlays] to toggle latex overlays.
</p>

<p>
You can use \\[org-ref-helm-insert-cite-link]  to insert citations.
</p>

<p>
That more or less does it! I don't know if this is the canonical way to do this, but it works nicely here. You can also use overlays, but I found them a little confusing because they are not editable, and you have to toggle the minor mode to see them. Here we have unobtrusive tooltips. One downside is these won't export in any fashion in org-mode since it is not part of the syntax. It might be a good idea to adjust `font-lock-extra-managed-props' for this
</p>

<p>
It works for this syntax too: `helm', which is also commonly used in doc strings. This should be pretty handy in org-mode documents about Emacs!
</p>
<p>Copyright (C) 2015 by John Kitchin. See the <a href="/copying.html">License</a> for information about copying.<p><p><a href="/org/2015/11/22/Adding-emacs-command-key-bindings-and-help-functionality-to-org-mode.org">org-mode source</a><p><p>Org-mode version = 8.2.10</p>